Revit 2027 API
RebarSplice.SourceRebarId Property
 Identifies the source of the target rebar which is part of this rebar splice. The source rebar is the one from which this rebar splice was obtained.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SourceRebarId { get; }
Public ReadOnly Property SourceRebarId As ElementId
	Get
public:
property ElementId^ SourceRebarId {
	ElementId^ get ();
}
member SourceRebarId : ElementId with get
Property Value
ElementId
See Also
Reference
RebarSplice Class
Autodesk.Revit.DB.Structure Namespace